SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( OR-63929-J

Comment( ******REPORT BASED ADVANCED FEATURES APPLIED******* )

Comment( ************** General Information***************** )
Type ( Engine )
WagonShape ( DR_BR_O2_63929.s )
	Size  ( 2.76139m 4.19335m 11.843657m )
WheelRadius ( 18.625in )comment (Front Bogie)
Mass ( 75.8t-uk )

Comment( ************ Coupler Information ****************** )
	
Comment( == Rear Coupler == )
Coupling (
		Type ( Bar )
		Spring (
			Break ( 710kN 1220kN )
			r0 ( 5cm 0cm )
		)
	)
Comment( == Front Coupler == )
	Coupling (
			Type ( Chain )
			Spring (
			Break ( 600kN 1000kN )
			r0 ( 20cm 0cm )
			)
	)
	
Comment( ********** Brakes, Type, Force, etc *************** )
BrakeEquipmentType( Vacuum_brake, Auxilary_reservoir )
BrakeSystemType( Vacuum_single_pipe )
MaxBrakeForce( 208kN )
BrakeCylinderPressureForMaxBrakeBrakeForce ( 21inHg )

ORTSNumberBrakeCylinders ( 2 )
Comment ( Assume 1 x 30in vacuum cylinder with 9in stroke )
Comment ( OpenRails assumes 4.5in stroke so this is set as two cylinders )
ORTSBrakeCylinderSize ( 30in )
ORTSAuxilaryResCapacity ( 8.25ft^3 ) Comment ( Based on Phillipson 16.5ft^3 vacuum chamber for 30in x 9in vacuum cylinder )

Brakepipevolume (1.29ft^3 ) Comment (* based on length of loco plus 16 feet for bends, branches and hoses *)

MaxReleaseRate ( 2.5inHg/s ) 
Comment ( use MaxReleaseRate ( 10inHg/s ) for steam braked class V2; MaxReleaseRate ( 2.5inHg/s )for vacuum braked class V2 )

MaxApplicationRate ( 2.0inHg/s )
Comment ( use MaxApplicationRate ( 1.3inHg/s ) for steam braked class V2; MaxApplicationRate ( 2.0inHg/s )for vacuum braked class V2 )

Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121) 

Comment( ********* Curve Resistance & SuperElevation ********* )
CentreOfGravity ( 0m 2.7m 0m )
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 17.0ft 6.0in )
Comment( No. Wheels-1 x 5/4 )

Comment( ***************** Friction************************* )

ORTSBearingType ( Friction )

Comment( CN 1990 DWx18)
ORTSDavis_A ( 7280 )
ORTSDavis_B ( 25.34 )
ORTSDavis_C ( 5.342 )

ORTSWagonFrontalArea (100)
ORTSDavisDragConstant (0.0024)

Comment(  ******* Lights Section *******  Included in this section - Type, Colour, Location, Size, Control, etc)


Lights ( 2
  Light (
   comment( Flickering firebox )
   Type  ( 0 )
   Conditions (
    Headlight ( 0 )
    Unit ( 0 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
    State (
     Duration ( 0.05 )
     LightColour ( 80ff7200 )
     Position ( 0 1.78 -4.8 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 1.4 )
     )
    State (
     Duration ( 0.05 )
     LightColour ( 80ffe610 )
     Position ( 0 1.78 -4.8 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 1.4 )
         
        )
      )
   )

  Light (
   comment( Head light left - J )
    Type  ( 0 )
    Conditions (
       Headlight ( 4 )
       Unit ( 2 )Service( 2 )
      )
    FadeIn ( 0.5 )
    FadeOut ( 0.5 )
    Cycle  ( 0 )
    States ( 1
       State (
         Duration ( 0.0 )
         LightColour ( ccccaaaa )
         Position ( 1.05 1.36 5.52 )
         Azimuth ( 0 0 0 )
         Transition ( 0 )
         Radius ( 0.7 )
        )
      )
    )
  )
	
Comment( ******* Miscellaneous Wagon Information************ )


Comment (Passenger View)	
	Inside (
        PassengerCabinFile ( DR_BR_O2_63929.s )
        PassengerCabinHeadPos ( 1.423 3.0 -3.2 )
        RotationLimit ( 90 180 160 )
        StartDirection ( 0 0 0 )
  	)
Sound (	"..\\..\\Common.Steam\\A3Sound\\B17eng.sms" )
)

Engine ( OR-63929-J

Effects
	(
	SteamSpecialEffects	(
	comment(the format of these little blocks is as follow:

	offset.x offset.y offset.z
	normal.x normal.y normal.z
	width in metres

	defining the offset from the shape pivot point where steam / 	smoke should appear, the direction it should go and the 	width of the nozzle
			)
   WhistleFX
   (
    0.0 3.7 -4.43
    0 1 0
    0.08
   )

   SafgetyValvesFX
   (
    0 3.792 -4
    0 1 0
    0.35 
   )

   StackFX
   (
    0 4 3.6
    0 1 0
    0.3
   )

   DrainpipeFX
   (
    -1.5 1.258 -3.886
    -0.4 -1 -0.2
    0.05
   )
			
Injectors2FX
	(
	-1.2 1.2 -5
	0 -1 0
	0.12
	)
Injectors1FX
	(
	1.2 1.2 -5
	0 -1 0
	0.12
	)
   CylindersFX
   (
    1.083 0.3 3.2
    0 0 1
    0.17
   )
   CylindersFX
   (
    1.083 0.3 3.8
    0 0 1
    0.17
   )
   CylindersFX
   (
    -1.083 0.3 3.2
    0 0 1
    0.17
   )
   CylindersFX
   (
    -1.083 0.3 3.8
    0 0 1
    0.17
   )
  )
)

Wagon ( OR-63929-J )
Comment ( *************General Information****************** )

ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 28in )
NumWheels ( 4 )
ORTSDriveWheelWeight ( 70.4t-uk )
Sanding ( 25mph )

Comment ( ******************** Boiler ************************ )

ORTSSteamBoilerType ( Superheated )
BoilerVolume ( 269ft^3 )  
ORTSEvaporationArea ( 2032ft^2 )
ORTSSuperheatArea ( 430.5ft^2 )
MaxBoilerPressure ( 180psi )

Comment ( ****************** Cylinders *********************** )

NumCylinders ( 3 )
CylinderStroke ( 26in ) 
CylinderDiameter ( 18.5in ) 
ORTSCylinderEfficiencyRate ( 1.0 )  

Comment ( ********************* Fire ************************* ) 

ORTSFuelCalorific ( 13700btu/lb )
ORTSGrateArea ( 27.5ft^2 )
SteamFiremanMaxPossibleFiringRate( 3000 ) 
ShovelCoalMass ( 14lb )     

Comment ( ****************** Fuel ************************* )

MaxTenderCoalMass ( 5t-uk )
MaxTenderWaterMass ( 35000lb )
IsTenderRequired( 1 )	

ORTSWaterScoopFillElevation ( 2.8m )
ORTSWaterScoopDepth ( 3.0in ) Comment (* LNER standard scoop - depth varies depending on trough and area of operation *)
ORTSWaterScoopWidth ( 10.875in )


Comment(       ********ADVANCED PARAMETERS**********      )

ORTSBoilerEvaporationRate ( 13 )   

Comment(ORTSMaxIndicatedHorsepower ( 1200.0hp ))   

Comment(ORTSMaxSuperheatTemperature ( 240.0 ))   

Comment(ORTSCylinderInitialPressureDrop ( 0.0 0.99 350 0.94 ))

ORTSBoilerEfficiency( 0.0 0.91  190.0 0.455 )   
Comment(From Report)

ORTSBurnRate( 0.0 10.0   12000.0 1430.0   14000.0 1725.0   18000.0 2350.0   22000.0 3110.0   26000.0 4030.0   30000.0 5270.0   31000.0 5760.0  33000.0 8640 )   
Comment(From Report)

ORTSTractiveEffortFactor (0.85)
    
Comment ( ****************Brake System ******************** )   

BrakesTrainBrakeType( "Vacuum_single_pipe" )
ORTSBrakePipeTimeFactor ( 0.03s )
TrainPipeLeakRate ( 0.03inHg/s )


Comment ( *** Ejectors *** )
Comment (* Estimate for Davies & Metcalfe Type VB ejector *)
VacuumBrakesHasVacuumPump ( 0 )
ORTSBrakePipeChargingRate ( 0.32inHg/s )
VacuumBrakesLargeEjectorUsageRate ( 600lb/h )
VacuumBrakesSmallEjectorUsageRate ( 240lb/h )
VacuumBrakesMinBoilerPressureMaxVacuum ( 90psi )


Comment ( *** Train Brake Valve *** )
TrainBrakesControllerMaxSystemPressure ( 21inHg )
ORTSBrakeEmergencyTimeFactor ( 5s )
ORTSBrakePipeTimeFactor ( 0.02s )
ORTSBrakeServiceTimeFactor ( 10.0s )


Comment ( **************** Engine Controls ***************** )   
EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.75 0.75 0.01 0 
            NumNotches( 0 )		
  		)

Brake_Train ( 0 1 0.1 0.2
NumNotches( 3
Notch(0    0 TrainBrakesControllerReleaseStart )
Notch(0.1  0 TrainBrakesControllerRunningStart )
Notch(0.2  1 TrainBrakesControllerVacuumContinuousServiceStart ) ) )

ORTSSmallEjector ( 0 1 0.1 0.55 NumNotches ( 0 ) )


FireDoor ( 0 1 0.1 0
	NumNotches ( 0 ))
Sanding( 0 1 0 )
Blower ( 0 1 0.025 0.2
	NumNotches ( 0 ))
Shovel ( 0 1 0.1 0
	NumNotches ( 0 ))
DampersFront ( 0 1 0.1 1
	NumNotches ( 0 ))
DampersBack ( 0 1 0.1 0
	NumNotches ( 0 ))
ORTSSteamHeat( 0 1 0.0125 0.5 )
Injector1Steam ( 0 1 0 )
Injector2Steam ( 0 1 0 )
Injector1Water ( 0 1 0.1 0
	NumNotches ( 0 ))
Injector2Water ( 0 1 0.1 0
	NumNotches ( 0 ))
CylinderCocks ( 0 1 1 )
Whistle ( 0 1 0 )
WaterScoop ( 0 1 0 )
)

Comment ( ************ Miscellaneous Information ************* )   

Cabview ( O2.cvf )
HeadOut (  -1.423 3.0 -3.2 )
Sound (	"..\\..\\Common.Steam\\A3Sound\\B17cab.sms" )
Name ( "63929 O2, Mineral Class J, Grantham Shed 34F, TE 36.47Klbf" )
Description (
"The O2 was a three cylinder development of Gresley's O1 2-8-0 mineral locomotive, and was the first design to use his conjugated valve gear. In 1915, Gresley applied for patent rights for a conjugated valve gear using either rocking shafts or motion levers to control the valves on the central cylinder on a three cylinder locomotive. The patent application recognised a similar attempt at using a two-to-one lever for the same effect. This is thought to be Joy's patent of 1884. In 1916, Gresley's patent agents informed him of a more recent patent of Holcroft's from 1909 that had lapsed in 1913. Therefore he continued with the application, and the patent was accepted in October 1916 (No. 15769). The frames for the first of the new engines were actually ordered in February 1916. An outline drawing appeared in August 1917 for a locomotive with two 21in by 30in cylinders. This design was dropped, and instead a three-cylinder development of the O1 was built, incorporating the newly patented valve gear.\n"+
"\n"+
"The first O2 (No. 461) was built in May 1918. This used an alternate form of the conjugated valve gear with rocking shafts instead of motion levers. The advantage of three cylinders was that they allowed the same power from smaller cylinders. Smaller cylinders result in lighter pistons which experience significantly less wear. Shortly after No. 461 appeared, Gresley announced that he would concentrate on three cylinder designs in the future. Indeed, most of his famous designs such as the K3 2-6-0, A1 & A3 4-6-2s, A4 4-6-2, and V2 2-6-2 all had three cylinders and conjugate valve gear on the central cylinder.\n"+
"\n"+
"The O2 used an identical boiler to that used on the existing O1s, although a Weir feed pump was not fitted. The pony truck was also of the same design as that of the O1, incorporating Gresley's double swing-link suspension.\n"+
"\n"+
"A batch of ten further O2s were ordered in March 1919, and these were built by the North British Locomotive Co. in 1921. These featured a redesigned cylinder and steam chest layout, allowing the use of the simpler conjugate valve gear with 2 to 1 motion levers. This simpler form was actually suggested to Gresley by Holcroft, and had already been introduced on the K3 2-6-0. This would become the standard on the O2s, although No. 461 was never rebuilt with the simpler motion.\n"+
"\n"+
"Class O2/2 No. 63940 at Grantham in 1958 (PH.Groom)\n"+
"Immediately after Grouping (1923), fifteen more O2s were quickly built. In order to fit the LNER's 13ft 0.5in Composite Loading Gauge these engines were fitted with a lower profile cab, a re-positioned whistle, and a shorter chimney. These were classified as O2/2. Construction of a further fifty O2s was considered in 1924, but this was cancelled due to the availability of large quantities of war surplus O4 ROD locomotives.\n"+
"\n"+
"All of the GNR O2s and the 1923 LNER O2s were built with split-ring piston valves. These piston valves suffered the same lubrication and wear problems as their counterparts on the O1s, and were replaced with Knorr-type piston valves from 1923.\n"+
"\n"+
"The next order was placed in 1929, for eight O2s as a Group Standard type. With a depressed rail industry, requirements were not urgent and delivery did not occur until 1932. This was followed by a second order for eight in 1933, and then a hiatus until wartime requirements led to the construction of twenty five between 1942 and 1943 in three batches. All 41 Group Standard O2s were classified as O2/3. In total, 67 O2s were built by the Great Northern Railway (GNR) and the LNER.\n"+
"\n"+
"In March 1939, the original eleven GNR O2s were rebuilt with lower cabs to fit the 13ft 0.5in loading gauge. Side windows were also fitted to the cabs. No. 3461 (the original O2) was classified as O2, whilst the remaining GNR locomotives were classified as O2/1 with the fitting of the side window cabs.\n"+
"\n"+
"Long travel valve gear was introduced to other Gresley three cylinder designs in the late 1920s. The amended valve gear was fitted to the K3 2-6-0s as a matter of priority before the O2s were looked at in 1930. Cost estimates were consisted prohibitive, and none of the existing O2s were fitted with the long travel valve gear. However, all of the Group Standard O2s were built after this date and were built with long travel valve gear.\n"+
"All 67 O2s survived into Nationalisation (1948), but No. 3921 (the original O2) was quickly withdrawn in May 1948 after exactly thirty years of service. This was probably due to the non-standard nature of No. 3921's motion. From February 1949, Diagram 100A boilers were slowly fitted to the remaining engines as their old boilers came up for renewal. In total, over twenty O2s were fitted with the new boilers.\n"+
"\n"+
"Allocations during British Railways ownership varied throughout the former LNER lines in England. Frodingham had an allocation until 1955 to haul iron ore traffic. Grantham, Doncaster, and Mexborough all had varying allocations. Trips to Bridlington and Tyneside were recorded during this period, and in 1957 No. 63935 was even observed on the Hawes line hauling a pick-up goods.\n"+
"\n"+
"Withdrawals of the remaining O2s started in 1960 with the withdrawal of four locomotives. Withdrawals accelerated with the last forty withdrawn in 1963. Sixteen appear to have been kept in storage for up to a year before being scrapped."
)
)
